<div>
<?php
// Задание № 1
$a = 0;
while($a <= 100) {
	if ($a%3 == 0)
		echo "$a";
	$a++;
}
?>
</div>
-------------------------------------------------
<div>
<?php
// Задание № 2
$b = 0;
do {
	
	if ($b == 0)
        echo "$b - ноль</br>";
	elseif ($b % 2 == 0)
        echo "$b - четное число</br>";
	else 
		echo "$b - нечетное число</br>";
	
}
while ($b++ <= 9);

?>
</div>
-------------------------------------------------
<div>
<?php
// задание № 3

$regions = array( "Мос обл" => array( "Москва", 
                         "Нью-Йорк",
                         "Лондон" 
                       ),
                  "Лен обл" => array( "Копенгаген", 
                         "Париж",
                         "Бостон" 
                       ),
                  "Ряз обл" => array( "Хьюстон", 
                         "Мадрид",
                         "Омск" 
                       )
                );

	foreach ($regions as $key => $value) {
		echo "$key :</br>";
    foreach ($value as $otherKey => $val) {
		echo "$val, ";
	}
	echo "</br>";
	}
	
?>
</div>
-------------------------------------------------
<div>
<?php
// Задание № 4
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
print_r($converter);
?>
</div>
-------------------------------------------------
<div>
<?php
// Задание № 5
	echo str_replace(' ', '_', 'abc abc abc abc');
?>
</div>
-------------------------------------------------
<div>
<?php
// задание № 6
$arr = [
   ["apple", "orange", "grape"],
   ["pie","tart","cake"]
];

echo "<ul>";

for($i = 0; $i < count($arr); $i++){
  for($j = 0; $j < count($arr[$i]); $j++){
   echo "<li>".$arr[$i][$j]."</li>";
  }
}

echo "</ul>";
?>
</div>
-------------------------------------------------
<div>
<?php
// задание № 7
for ($i = 0, $j = 0; $i <= 10; $j += $i, print $i, $i++);
?>
</div>
